{
  "backend/main.mo": "Motoko actor with a single public query function `greet` that takes a name parameter and returns a greeting string.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of a 'Contact Us' button with mailto link to viitjeetec@gmail.com in the frontend header and footer.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including App.tsx (landing page with Contact Us button), index.css (OKLCH color system), tailwind.config.js (Tailwind theme configuration), and useQueries.ts (React Query hooks).",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark modes using grayscale colors (no warm orange theme present in this file).",
  "frontend/index.html": "HTML entry point for the viitjee application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React component rendering the viitjee educational platform landing page with hero section, features, courses (Physics, Chemistry, Mathematics with icons and headers), about section, footer, and Contact Us buttons in header and footer linking to viitjeetec@gmail.com.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance with Internet Identity authentication support, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hook `useGreeting` that fetches a greeting from the backend actor for a given name.",
  "frontend/src/index.css": "Tailwind CSS base styles with OKLCH color system using warm orange primary colors for light and dark modes, plus typography and font feature settings.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient, InternetIdentityProvider, and renders the App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with OKLCH color tokens, custom border radius, shadows, Inter font family, and accordion animation keyframes.",
  "project_state.json": "Project state file tracking the \"viitjee\" educational app with 13 features including branding, landing page, visual theme (non-blue/purple), logo integration, and navigation. Known issue: intermittent build timeouts requiring retry."
}